app/controllers/categories_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 10)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 10)
---
  def edit
    @category = Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 11)
DELETE FROM `categories` WHERE `id` = 11
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy