app/controllers/geologies_controller.rb

  def edit
    @geology = Geology.find(params[:id])
---
SELECT * FROM `geologies` WHERE (`geologies`.`id` = 3)