app/controllers/home_controller.rb

SELECT * FROM `projects` WHERE (`projects`.`published` = 1)
---
  def index
  @categories = Category.find(:all)

  @projects = Project.find(:all, :conditions => { :published => 1})