app/controllers/projects_controller.rb

SELECT count(*) AS count_all FROM `projects` WHERE ((projects.number LIKE '%test%') OR (projects.name LIKE '%test%') OR (projects.city LIKE '%test%'))
---
  def index
   #@projects = Project.find(:all)
	@search = Project.search(params[:search])
	@projects, @projects_count = @search.paginate(:page => params[:page], :per_page => 25), @search.count

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `media` WHERE (`media`.project_id = 2) ORDER BY media.position
---
  def show
    @project = Project.find(params[:id])
    @media = @project.media.all(:order => 'position')

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
SELECT * FROM `media` WHERE (`media`.project_id = 2) ORDER BY position
---
  def edit

    @project = Project.find(params[:id])
	@media = @project.media.all(:order => 'position')

INSERT INTO `projects` (`name`, `city`, `final_cost`, `overburden_max`, `technical_data`, `excavation_area_max`, `updated_at`, `number`, `currency_id`, `commencement_date`, `services_performed`, `tunnel_length_max`, `published`, `overburden_min`, `activity_id`, `country_id`, `client_id`, `designer_id`, `type_id`, `unit_id`, `excavation_area_min`, `contractor_id`, `estimated_cost`, `tunnel_length_min`, `description`, `completion_date`, `geology`, `owner_id`, `bid_price`, `state_id`, `created_at`) VALUES('ttttt', '', NULL, NULL, '', NULL, '2009-12-15 11:04:28', '1111', 1, NULL, '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, '', NULL, '', NULL, NULL, NULL, '2009-12-15 11:04:28')
---
  def create
    @project = Project.new(params[:project])

   respond_to do |format|
      if @project.save

SELECT * FROM `projects` WHERE (`projects`.`id` = 2)
UPDATE `projects` SET `geology` = '<p><strong>dfdgdfgdfgdfg</strong></p>', `updated_at` = '2009-12-17 10:06:57' WHERE `id` = 403
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT * FROM `projects` WHERE (`projects`.`id` = 5)
DELETE FROM `projects` WHERE `id` = 5
---
  def destroy



	@project = Project.find(params[:id])
    @project.destroy

SELECT * FROM `countries` WHERE (`countries`.`id` = 454)
---
def state_select_box
    @country = Country.find(params[:country_id]) unless params[:country_id].empty?