app/controllers/states_controller.rb

SELECT * FROM `states` WHERE (`states`.`id` = 104)
---
  def edit
    @state = State.find(params[:id])