app/controllers/users_controller.rb

    def create
      @user = User.new(params[:user])
      if @user.save
---
INSERT INTO `users` (`updated_at`, `crypted_password`, `username`, `password_salt`, `persistence_token`, `email`, `created_at`) VALUES('2009-12-14 17:22:55', '0f052c5246d7d8e61af0e2cfcb7944ad271c3dac215dc74cfe91249ea8491a1128a45cdbde26303eedccbefc8a670e701fad2196527758a5038a47380b7e826f', 'mwiesbauer', 'x7rZE6zPT_LSensuLXIR', 'bc491dda41b853d526ee5627eec0479f9c0bcd9d8b23f885619e5c2fecd69b7e7b0501409c540884b1d5340bce488e0fa7bd316328d5f76a96b7e2a6e6ca2557', 'mwiesbauer@dr-sauer.com', '2009-12-14 17:22:55')